TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/driverlib/empty_driverlib_src/ti/driverlib/dl_adc12.h
    /*! ADC12 Memory conversion index 3 */
    DL_ADC12_MEM_IDX_3 = 3,

    /*! ADC12 Memory conversion index 4 */
    DL_ADC12_MEM_IDX_4 = 4,

    /*! ADC12 Memory conversion index 5 */
    DL_ADC12_MEM_IDX_5 = 5,

    /*! ADC12 Memory conversion index 6 */
    DL_ADC12_MEM_IDX_6 = 6,

    /*! ADC12 Memory conversion index 7 */
    DL_ADC12_MEM_IDX_7 = 7,

    /*! ADC12 Memory conversion index 8 */
    DL_ADC12_MEM_IDX_8 = 8,

    /*! ADC12 Memory conversion index 9 */
    DL_ADC12_MEM_IDX_9 = 9,

    /*! ADC12 Memory conversion index 10 */
    DL_ADC12_MEM_IDX_10 = 10,

    /*! ADC12 Memory conversion index 11 */
    DL_ADC12_MEM_IDX_11 = 11,

} DL_ADC12_MEM_IDX;

/*! @enum DL_ADC12_REPEAT_MODE */
typedef enum {

    /*! Sequence mode single repeat */
    DL_ADC12_REPEAT_MODE_ENABLED = ADC12_CTL1_CONSEQ_REPEATSINGLE,

    /*! Sequence mode single */
    DL_ADC12_REPEAT_MODE_DISABLED = ADC12_CTL1_CONSEQ_SINGLE

} DL_ADC12_REPEAT_MODE;

/*! @enum DL_ADC12_SAMPLING_SOURCE */
typedef enum {
    /*! Timer high phase is used as source of the sample signal */
    DL_ADC12_SAMPLING_SOURCE_AUTO = ADC12_CTL1_SAMPMODE_AUTO,

    /*! External or software trigger is used as source of the sample signal */
    DL_ADC12_SAMPLING_SOURCE_MANUAL = ADC12_CTL1_SAMPMODE_MANUAL
} DL_ADC12_SAMPLING_SOURCE;

/*! @enum DL_ADC12_TRIG_SRC */
typedef enum {
    /*! Conversion is triggered by software. */
    DL_ADC12_TRIG_SRC_SOFTWARE = ADC12_CTL1_TRIGSRC_SOFTWARE,

    /*! Conversion is triggered by hardware */
    DL_ADC12_TRIG_SRC_EVENT = ADC12_CTL1_TRIGSRC_EVENT

} DL_ADC12_TRIG_SRC;

/*! @enum DL_ADC12_SAMP_CONV_RES */
typedef enum {
    /*! 12-bits resolution */
    DL_ADC12_SAMP_CONV_RES_12_BIT = ADC12_CTL2_RES_BIT_12,
    /*! 10-bits resolution */
    DL_ADC12_SAMP_CONV_RES_10_BIT = ADC12_CTL2_RES_BIT_10,
    /*! 8-bits resolution */
    DL_ADC12_SAMP_CONV_RES_8_BIT = ADC12_CTL2_RES_BIT_8
} DL_ADC12_SAMP_CONV_RES;

/*! @enum DL_ADC12_SAMP_CONV_DATA_FORMAT */
typedef enum {
    /*! Results are read as binary unsigned, right aligned. */
    DL_ADC12_SAMP_CONV_DATA_FORMAT_UNSIGNED = ADC12_CTL2_DF_UNSIGNED,

    /*! Result are read as signed binary (2s complement), left aligned. */
    DL_ADC12_SAMP_CONV_DATA_FORMAT_SIGNED = ADC12_CTL2_DF_SIGNED

} DL_ADC12_SAMP_CONV_DATA_FORMAT;

/*! @enum DL_ADC12_IIDX */
typedef enum {
    /*! ADC12 interrupt index for MEMRESX overflow */
    DL_ADC12_IIDX_OVERFLOW = ADC12_CPU_INT_IIDX_STAT_OVIFG,

    /*! ADC12 interrupt index for sequence conversion trigger overflow */
    DL_ADC12_IIDX_TRIG_OVERFLOW = ADC12_CPU_INT_IIDX_STAT_TOVIFG,

    /*! ADC12 interrupt index for MEMRESx result higher than window
     * comparator high threshold */
    DL_ADC12_IIDX_WINDOW_COMP_HIGH = ADC12_CPU_INT_IIDX_STAT_HIGHIFG,

    /*! ADC12 interrupt index for MEMRESx result lower than window
    *  comparator low threshold */
    DL_ADC12_IIDX_WINDOW_COMP_LOW = ADC12_CPU_INT_IIDX_STAT_LOWIFG,

    /*! ADC12 interrupt index for result in range */
    DL_ADC12_IIDX_INIFG = ADC12_CPU_INT_IIDX_STAT_INIFG,

    /*! ADC12 interrupt index for DMA done */
    DL_ADC12_IIDX_DMA_DONE = ADC12_CPU_INT_IIDX_STAT_DMADONE,

    /*! ADC12 interrupt index for MEMRESX underflow */
    DL_ADC12_IIDX_UNDERFLOW = ADC12_CPU_INT_IIDX_STAT_UVIFG,

    /*! ADC12 interrupt index for MEM0 result loaded interrupt */
    DL_ADC12_IIDX_MEM0_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG0,

    /*! ADC12 interrupt index for MEM1 result loaded interrupt */
    DL_ADC12_IIDX_MEM1_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG1,

    /*! ADC12 interrupt index for MEM2 result loaded interrupt */
    DL_ADC12_IIDX_MEM2_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG2,

    /*! ADC12 interrupt index for MEM3 result loaded interrupt */
    DL_ADC12_IIDX_MEM3_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG3,

    /*! ADC12 interrupt index for MEM4 result loaded interrupt */
    DL_ADC12_IIDX_MEM4_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG4,

    /*! ADC12 interrupt index for MEM5 result loaded interrupt */
    DL_ADC12_IIDX_MEM5_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG5,

    /*! ADC12 interrupt index for MEM6 result loaded interrupt */
    DL_ADC12_IIDX_MEM6_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG6,

    /*! ADC12 interrupt index for MEM7 result loaded interrupt */
    DL_ADC12_IIDX_MEM7_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG7,

    /*! ADC12 interrupt index for MEM8 result loaded interrupt */
    DL_ADC12_IIDX_MEM8_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG8,

    /*! ADC12 interrupt index for MEM9 result loaded interrupt */
    DL_ADC12_IIDX_MEM9_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG9,

    /*! ADC12 interrupt index for MEM10 result loaded interrupt */
    DL_ADC12_IIDX_MEM10_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG10,

    /*! ADC12 interrupt index for MEM10 result loaded interrupt */
    DL_ADC12_IIDX_MEM11_RESULT_LOADED = ADC12_CPU_INT_IIDX_STAT_MEMRESIFG11,
} DL_ADC12_IIDX;

/* clang-format on */
/*! @enum DL_ADC12_CLOCK */
typedef enum {
    /*! SYSOSC is the source of ADC sample clock*/
    DL_ADC12_CLOCK_SYSOSC = ADC12_CLKCFG_SAMPCLK_SYSOSC,
    /*! ULPCLK is the source of ADC sample clock*/
    DL_ADC12_CLOCK_ULPCLK = ADC12_CLKCFG_SAMPCLK_ULPCLK,
    /*! HFCLK is the source of ADC sample clock*/
    DL_ADC12_CLOCK_HFCLK = ADC12_CLKCFG_SAMPCLK_HFCLK,
} DL_ADC12_CLOCK;

/*! @enum DL_ADC12_CLOCK_DIVIDE */
typedef enum {

    /*! Divide sample clock source by 1 */
    DL_ADC12_CLOCK_DIVIDE_1 = ADC12_CTL0_SCLKDIV_DIV_BY_1,

    /*! Divide sample clock source by 2 */
    DL_ADC12_CLOCK_DIVIDE_2 = ADC12_CTL0_SCLKDIV_DIV_BY_2,

    /*! Divide sample clock source by 4 */
    DL_ADC12_CLOCK_DIVIDE_4 = ADC12_CTL0_SCLKDIV_DIV_BY_4,

    /*! Divide sample clock source by 8 */
    DL_ADC12_CLOCK_DIVIDE_8 = ADC12_CTL0_SCLKDIV_DIV_BY_8,

    /*! Divide sample clock source by 16 */
    DL_ADC12_CLOCK_DIVIDE_16 = ADC12_CTL0_SCLKDIV_DIV_BY_16,

    /*! Divide sample clock source by 24 */
    DL_ADC12_CLOCK_DIVIDE_24 = ADC12_CTL0_SCLKDIV_DIV_BY_24,

    /*! Divide sample clock source by 32 */
    DL_ADC12_CLOCK_DIVIDE_32 = ADC12_CTL0_SCLKDIV_DIV_BY_32,

    /*! Divide sample clock source by 48 */
    DL_ADC12_CLOCK_DIVIDE_48 = ADC12_CTL0_SCLKDIV_DIV_BY_48,

} DL_ADC12_CLOCK_DIVIDE;

/*! @enum DL_ADC12_CLOCK_FREQ_RANGE */
typedef enum {
    /*! Specifies ADC clock (ADCCLK) frequency range is from 1 MHz to 4 MHz */
    DL_ADC12_CLOCK_FREQ_RANGE_1_TO_4 = ADC12_CLKFREQ_FRANGE_RANGE1TO4,

    /*! Specifies ADC clock (ADCCLK) frequency range is from 4 MHz to 8 MHz */
    DL_ADC12_CLOCK_FREQ_RANGE_4_TO_8 = ADC12_CLKFREQ_FRANGE_RANGE4TO8,

    /*! Specifies ADC clock (ADCCLK) frequency range is from 8 MHz to 16 MHz */
    DL_ADC12_CLOCK_FREQ_RANGE_8_TO_16 = ADC12_CLKFREQ_FRANGE_RANGE8TO16,

    /*! Specifies ADC clock (ADCCLK) frequency range is from 16 MHz to 20 MHz */
    DL_ADC12_CLOCK_FREQ_RANGE_16_TO_20 = ADC12_CLKFREQ_FRANGE_RANGE16TO20,

    /*! Specifies ADC clock (ADCCLK) frequency range is from 20 MHz to 24 MHz */
    DL_ADC12_CLOCK_FREQ_RANGE_20_TO_24 = ADC12_CLKFREQ_FRANGE_RANGE20TO24,

    /*! Specifies ADC clock (ADCCLK) frequency range is from 24 MHz to 32 MHz */
    DL_ADC12_CLOCK_FREQ_RANGE_24_TO_32 = ADC12_CLKFREQ_FRANGE_RANGE24TO32,

