TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/driverlib/empty_driverlib_src/ti/driverlib/dl_adc12.h
    /*! Specifies ADC clock (ADCCLK) frequency range is from 32 MHz to 40 MHz */
    DL_ADC12_CLOCK_FREQ_RANGE_32_TO_40 = ADC12_CLKFREQ_FRANGE_RANGE32TO40,

    /*! Specifies ADC clock (ADCCLK) frequency range is from 40 MHz to 48 MHz */
    DL_ADC12_CLOCK_FREQ_RANGE_40_TO_48 = ADC12_CLKFREQ_FRANGE_RANGE40TO48,

} DL_ADC12_CLOCK_FREQ_RANGE;

/**
 * @brief  Configuration struct for @ref DL_ADC12_setClockConfig.
 */
typedef struct {
    /*! ADC12 clock source selection. This sources the ADCCLK. One of
     * @ref DL_ADC12_CLOCK */
    DL_ADC12_CLOCK clockSel;
    /*! ADC12 clock source frequency range. One of
     * @ref DL_ADC12_CLOCK_FREQ_RANGE */
    DL_ADC12_CLOCK_FREQ_RANGE freqRange;
    /*! ADC12 sample clock divider selection. This is used to generate the ADC12
     * Sample Clock frequency. One of @ref DL_ADC12_CLOCK_DIVIDE */
    DL_ADC12_CLOCK_DIVIDE divideRatio;
} DL_ADC12_ClockConfig;

/**
 * @brief Enables power on adc12 module
 *
 * @param adc12        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_ADC12_enablePower(ADC12_Regs *adc12)
{
    adc12->ULLMEM.GPRCM.PWREN =
        (ADC12_PWREN_KEY_UNLOCK_W | ADC12_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables power on adc12 module
 *
 * @param adc12        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_ADC12_disablePower(ADC12_Regs *adc12)
{
    adc12->ULLMEM.GPRCM.PWREN =
        (ADC12_PWREN_KEY_UNLOCK_W | ADC12_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if  power on adc12 module
 *
 * @param adc12        Pointer to the register overlay for the peripheral
 *
 * @return true if power is enabled
 * @return false if power is disabled
 */
__STATIC_INLINE bool DL_ADC12_isPowerEnabled(ADC12_Regs *adc12)
{
    return ((adc12->ULLMEM.GPRCM.PWREN & ADC12_PWREN_ENABLE_MASK) ==
            ADC12_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Resets adc12 peripheral
 *
 * @param adc12        Pointer to the register overlay for the ADC12 peripheral
 */
__STATIC_INLINE void DL_ADC12_reset(ADC12_Regs *adc12)
{
    adc12->ULLMEM.GPRCM.RSTCTL =
        (ADC12_RSTCTL_KEY_UNLOCK_W | ADC12_RSTCTL_RESETSTKYCLR_CLR |
            ADC12_RSTCTL_RESETASSERT_ASSERT);
}

/**
 * @brief Returns if adc12 peripheral was reset
 *
 * @param adc12        Pointer to the register overlay for the ADC12 peripheral
 *
 * @return true if peripheral was reset
 * @return false if peripheral wasn't reset
 *
 */
__STATIC_INLINE bool DL_ADC12_isReset(ADC12_Regs *adc12)
{
    return ((adc12->ULLMEM.GPRCM.STAT & ADC12_STAT_RESETSTKY_MASK) ==
            ADC12_STAT_RESETSTKY_RESET);
}

/**
 * @brief Initializes ADC12 for single sampling mode operation. This
 * initialization configures MEMCTL0 as the default memory control register for
 * the conversion. If the conversion needs use a different memory control
 * register the user can call @ref DL_ADC12_setStartAddress to specify a
 * different control register.
 *
 * @param[in] adc12       Pointer to the register overlay for the peripheral
 * @param[in] repeatMode  Specifies repeat configuration. One of
 *                    @ref DL_ADC12_REPEAT_MODE
 * @param[in] sampleMode  Specifies source of the sampling signal. One of
 *                    @ref DL_ADC12_SAMPLING_SOURCE
 * @param[in] trigSrc     Specifies sampling trigger source. One of
 *                    @ref DL_ADC12_TRIG_SRC
 * @param[in] resolution  Specifies sample conversion resolution. One of
 *                    @ref DL_ADC12_SAMP_CONV_RES
 * @param[in] dataFormat  Specifies sample conversion data format. One of
 *                    @ref DL_ADC12_SAMP_CONV_DATA_FORMAT
 *
 */
__STATIC_INLINE void DL_ADC12_initSingleSample(ADC12_Regs *adc12,
    uint32_t repeatMode, uint32_t sampleMode, uint32_t trigSrc,
    uint32_t resolution, uint32_t dataFormat)
{
    DL_Common_updateReg(&adc12->ULLMEM.CTL1,
        (repeatMode | sampleMode | trigSrc),
        (ADC12_CTL1_SAMPMODE_MASK | ADC12_CTL1_CONSEQ_MASK |
            ADC12_CTL1_TRIGSRC_MASK));

    DL_Common_updateReg(&adc12->ULLMEM.CTL2,
        (ADC12_CTL2_STARTADD_ADDR_00 | ADC12_CTL2_ENDADD_ADDR_00 | resolution |
            dataFormat),
        (ADC12_CTL2_STARTADD_MASK | ADC12_CTL2_ENDADD_MASK |
            ADC12_CTL2_RES_MASK | ADC12_CTL2_DF_MASK));
}

/**
 *  @brief Sets the start address for ADC conversion.
 *
 *  @param[in] adc12       Pointer to the register overlay for the peripheral
 *  @param[in] startAdd    If ADC has been initialized in Single Sample mode,
 *                         startAdd specifies the memory control register to be
 *                         used during conversion. If ADC is initialized in
 *                         sequence sampling mode, it specifies the first memory
 *                         control register in the sequence. One of
 *                         @ref DL_ADC12_SEQ_START_ADDR
 *
 */
__STATIC_INLINE void DL_ADC12_setStartAddress(
    ADC12_Regs *adc12, uint32_t startAdd)
{
    DL_Common_updateReg(
        &adc12->ULLMEM.CTL2, startAdd, ADC12_CTL2_STARTADD_MASK);
}

/**
 *  @brief Gets start address for ADC conversion.
 *
 *  @param[in] adc12       Pointer to the register overlay for the peripheral
 *
 *  @return One of @ref DL_ADC12_SEQ_END_ADDR
 *
 */
__STATIC_INLINE uint32_t DL_ADC12_getStartAddress(ADC12_Regs *adc12)
{
    return (adc12->ULLMEM.CTL2 & ADC12_CTL2_STARTADD_MASK);
}

/**
 *  @brief Sets the end address for ADC conversion.
 *
 *  @param[in] adc12       Pointer to the register overlay for the peripheral
 *  @param[in] endAdd      When ADC is initialized in sequence sampling  mode it
 *                         specifies the last memory control register in the
 *                         sequence. One of @ref DL_ADC12_SEQ_END_ADDR
 *
 */
__STATIC_INLINE void DL_ADC12_setEndAddress(ADC12_Regs *adc12, uint32_t endAdd)
{
    DL_Common_updateReg(&adc12->ULLMEM.CTL2, endAdd, ADC12_CTL2_ENDADD_MASK);
}

/**
 *  @brief Gets end address for ADC conversion.
 *
 *  @param[in] adc12       Pointer to the register overlay for the peripheral
 *
 *  @return One of @ref DL_ADC12_SEQ_END_ADDR
 *
 */
__STATIC_INLINE uint32_t DL_ADC12_getEndAddress(ADC12_Regs *adc12)
{
    return (adc12->ULLMEM.CTL2 & ADC12_CTL2_ENDADD_MASK);
}

/**
 * @brief Initializes ADC12 for sequence sampling mode operation
 *
 * @param[in] adc12       Pointer to the register overlay for the peripheral
 * @param[in] repeatMode  Specifies repeat configuration. One of
 *                        @ref DL_ADC12_REPEAT_MODE
 * @param[in] sampleMode  Specifies source of the sampling signal. One of
 *                        @ref DL_ADC12_SAMPLING_SOURCE
 * @param[in] trigSrc     Specifies sampling trigger source. One of
 *                        @ref DL_ADC12_TRIG_SRC
 * @param[in] startAdd    Specifies the starting address to sequence conversion.
 *                        One of @ref DL_ADC12_SEQ_START_ADDR
 * @param[in] endAdd      Specifies the ending address to sequence conversion.
 *                        One of @ref DL_ADC12_SEQ_END_ADDR
 * @param[in] resolution  Specifies sample conversion resolution. One of
 *                        @ref DL_ADC12_SAMP_CONV_RES
 * @param[in] dataFormat  Specifies sample conversion data format. One of
 *                        @ref DL_ADC12_SAMP_CONV_DATA_FORMAT
 */
__STATIC_INLINE void DL_ADC12_initSeqSample(ADC12_Regs *adc12,
    uint32_t repeatMode, uint32_t sampleMode, uint32_t trigSrc,
    uint32_t startAdd, uint32_t endAdd, uint32_t resolution,
    uint32_t dataFormat)
{
    DL_Common_updateReg(&adc12->ULLMEM.CTL1,
        (ADC12_CTL1_CONSEQ_SEQUENCE | repeatMode | sampleMode | trigSrc),
        (ADC12_CTL1_SAMPMODE_MASK | ADC12_CTL1_CONSEQ_MASK |
            ADC12_CTL1_TRIGSRC_MASK));

    DL_Common_updateReg(&adc12->ULLMEM.CTL2,
        (startAdd | endAdd | resolution | dataFormat),
        (ADC12_CTL2_ENDADD_MASK | ADC12_CTL2_STARTADD_MASK |
            ADC12_CTL2_RES_MASK | ADC12_CTL2_DF_MASK));
}

/**
 * @brief Returns ADC12 resolution
 *
 * @param[in] adc12       Pointer to the register overlay for the peripheral
 *
 * @return One of @ref DL_ADC12_SAMP_CONV_RES
 */
__STATIC_INLINE uint32_t DL_ADC12_getResolution(ADC12_Regs *adc12)
{
    return (adc12->ULLMEM.CTL2 & ADC12_CTL2_RES_MASK);
}

/**
 * @brief Returns ADC12 data format
 *
 * @param[in] adc12       Pointer to the register overlay for the peripheral
 *
 * @return One of @ref DL_ADC12_SAMP_CONV_DATA_FORMAT
 */
__STATIC_INLINE uint32_t DL_ADC12_getDataFormat(ADC12_Regs *adc12)
{
    return (adc12->ULLMEM.CTL2 & ADC12_CTL2_DF_MASK);
}

/**
 * @brief  Returns ADC12 sampling source
 *
 * @param[in] adc12   Pointer to the register overlay for the peripheral
 *
 * @return  One of @ref DL_ADC12_SAMPLING_SOURCE
 */
__STATIC_INLINE uint32_t DL_ADC12_getSamplingSource(ADC12_Regs *adc12)
{
    return (adc12->ULLMEM.CTL1 & ADC12_CTL1_SAMPMODE_MASK);
}

/**
 * @brief Returns ADC12 sampling mode
 *
 * @param[in] adc12   Pointer to the register overlay for the peripheral
 *
 * @return One of @ref DL_ADC12_SAMP_MODE
 */
__STATIC_INLINE uint32_t DL_ADC12_getSampleMode(ADC12_Regs *adc12)
{
    return (adc12->ULLMEM.CTL1 & ADC12_CTL1_CONSEQ_MASK);
}

/**
 * @brief Returns ADC12 trigger mode
 *
 * @param[in] adc12   Pointer to the register overlay for the peripheral
 *
 * @return One of @ref DL_ADC12_TRIG_SRC
 */
__STATIC_INLINE DL_ADC12_TRIG_SRC DL_ADC12_getTriggerSource(ADC12_Regs *adc12)
{
    uint32_t trigSrc = adc12->ULLMEM.CTL1 & ADC12_CTL1_TRIGSRC_MASK;

    return (DL_ADC12_TRIG_SRC)(trigSrc);
}

/**
 * @brief Start ADC12 conversion
 *
 * @param[in] adc12  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_ADC12_startConversion(ADC12_Regs *adc12)
{
    adc12->ULLMEM.CTL1 |= (ADC12_CTL1_SC_START);
}

/**
 * @brief Stop ADC12 conversion
 *
 * @param[in] adc12  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_ADC12_stopConversion(ADC12_Regs *adc12)
{
    adc12->ULLMEM.CTL1 &= ~(ADC12_CTL1_SC_START);
}

/**
 * @brief Check if ADC12 conversion is started
 *
 * @param[in] adc12  Pointer to the register overlay for the peripheral
 *
 * @return If ADC12 conversion is started
 *
 * @retval  true  ADC12 conversion is started
 * @retval  false ADC12 conversion is stopped
 */
__STATIC_INLINE bool DL_ADC12_isConversionStarted(ADC12_Regs *adc12)
{
    return ((adc12->ULLMEM.CTL1 & ADC12_CTL1_SC_MASK) == ADC12_CTL1_SC_START);
}

/**
 * @brief Enables DMA for data transfer
 *
 * @param[in] adc12 Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_ADC12_enableDMA(ADC12_Regs *adc12)
{
    adc12->ULLMEM.CTL2 |= (ADC12_CTL2_DMAEN_ENABLE);
}

/**
 * @brief Disables DMA for data transfer
 *
 * @param[in] adc12 Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_ADC12_disableDMA(ADC12_Regs *adc12)
{
    adc12->ULLMEM.CTL2 &= ~(ADC12_CTL2_DMAEN_ENABLE);
}

/**
 * @brief Check if DMA is enabled
 *
 * @param[in] adc12  Pointer to the register overlay for the peripheral
 *
 * @return If DMA is enabled
 *
 * @retval  true  DMA is enabled
 * @retval  false DMA is disabled
 */
__STATIC_INLINE bool DL_ADC12_isDMAEnabled(ADC12_Regs *adc12)
{
    return ((adc12->ULLMEM.CTL2 & ADC12_CTL2_DMAEN_ENABLE) ==
            ADC12_CTL2_DMAEN_ENABLE);
}

/**
 * @brief Set number of ADC results to be transfer on a DMA trigger
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 * @param[in] sampCnt  Number of ADC results to be transfer on a DMA trigger.
 *                     Valid range 0 - 24.
 *
 */
__STATIC_INLINE void DL_ADC12_setDMASamplesCnt(
    ADC12_Regs *adc12, uint8_t sampCnt)
{
    DL_Common_updateReg(&adc12->ULLMEM.CTL2, (((uint32_t) sampCnt) << 11),
        ADC12_CTL2_SAMPCNT_MASK);
}

/**
 * @brief Get number of ADC results to be transfer on a DMA trigger
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 *
 * @return Number of ADC results to be transfer on a DMA trigger
 */
__STATIC_INLINE uint8_t DL_ADC12_getDMASampleCnt(ADC12_Regs *adc12)
{
    return (uint8_t)((adc12->ULLMEM.CTL2 & ADC12_CTL2_SAMPCNT_MASK) >> 11);
}

/**
 * @brief Enables FIFO mode
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_ADC12_enableFIFO(ADC12_Regs *adc12)
{
    adc12->ULLMEM.CTL2 |= (ADC12_CTL2_FIFOEN_ENABLE);
}

/**
 * @brief Disables FIFO mode
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_ADC12_disableFIFO(ADC12_Regs *adc12)
{
    adc12->ULLMEM.CTL2 &= ~(ADC12_CTL2_FIFOEN_ENABLE);
}

/**
 * @brief Checks if FIFO mode is enabled
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 *
 * @return If FIFO mode is enabled
 *
 * @retval  true  FIFO mode is enabled
 * @retval  false FIFO mode is disabled
 *
 */
__STATIC_INLINE bool DL_ADC12_isFIFOEnabled(ADC12_Regs *adc12)
{
    return ((adc12->ULLMEM.CTL2 & ADC12_CTL2_FIFOEN_MASK) ==
            ADC12_CTL2_FIFOEN_ENABLE);
}

/**
 * @brief Configures ADC12 sample clock divider and sample clock frequency range
 *
 * @param[in] adc12       Pointer to the register overlay for the peripheral
 * @param[in] config      Pointer to the clock configuration struct
 *                        @ref DL_ADC12_ClockConfig.
 */
void DL_ADC12_setClockConfig(ADC12_Regs *adc12, DL_ADC12_ClockConfig *config);

/**
 * @brief Returns ADC12 sample clock configuration
 *
 * @param[in] adc12       Pointer to the register overlay for the peripheral
 * @param[in] config      Pointer to the clock configuration struct
 *                        @ref DL_ADC12_ClockConfig.
 */
void DL_ADC12_getClockConfig(ADC12_Regs *adc12, DL_ADC12_ClockConfig *config);

/**
 * @brief Configures ADC12 power down mode
 *
 * @param[in] adc12         Pointer to the register overlay for the peripheral
 * @param[in] powerDownMode Specifies the power down mode. One of
 *                          @ref DL_ADC12_POWER_DOWN_MODE.
 */
__STATIC_INLINE void DL_ADC12_setPowerDownMode(
    ADC12_Regs *adc12, uint32_t powerDownMode)
{
    DL_Common_updateReg(
        &adc12->ULLMEM.CTL0, powerDownMode, ADC12_CTL0_PWRDN_MASK);
}

/**
 * @brief Returns ADC power down mode
 *
 * @param[in] adc12         Pointer to the register overlay for the peripheral
 *
 * @return  The current ADC12 power down mode
 *
 * @retval  One of @ref DL_ADC12_POWER_DOWN_MODE
 */
__STATIC_INLINE uint32_t DL_ADC12_getPowerDownMode(ADC12_Regs *adc12)
{
    return (adc12->ULLMEM.CTL0 & ADC12_CTL0_PWRDN_MASK);
}

/**
 *  @brief      Enable ADC12 conversion
 *
 *  @param[in]  adc12  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_ADC12_enableConversions(ADC12_Regs *adc12)
{
    adc12->ULLMEM.CTL0 |= (ADC12_CTL0_ENC_ON);
}

/**
 *  @brief      Disable ADC12 conversion
 *
 *  @param[in]  adc12  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_ADC12_disableConversions(ADC12_Regs *adc12)
{
    adc12->ULLMEM.CTL0 &= ~(ADC12_CTL0_ENC_ON);
}

/**
 *  @brief      Check if ADC12 conversion is enabled
 *
 *  @param[in]  adc12  Pointer to the register overlay for the peripheral
 *
 *  @return     If the ADC12 conversion is enabled
 *
 *  @retval     true  The ADC12 conversion is enabled
 *  @retval     false The ADC12 conversion is disabled
 *
 */
__STATIC_INLINE bool DL_ADC12_isConversionsEnabled(ADC12_Regs *adc12)
{
    return ((adc12->ULLMEM.CTL0 & ADC12_CTL0_ENC_MASK) == ADC12_CTL0_ENC_ON);
}

/**
 * @brief Configure ADC12 hardware average
 *
 * @param[in] adc12       Pointer to the register overlay for the peripheral
 * @param[in] numerator   Specifies the number of conversion to accumulate. One
 *                        of @ref DL_ADC12_HW_AVG_NUM
 * @param[in] denominator Specifies the number to divide the accumulated value
 *                        by. One of @ref DL_ADC12_HW_AVG_DEN
 */
__STATIC_INLINE void DL_ADC12_configHwAverage(
    ADC12_Regs *adc12, uint32_t numerator, uint32_t denominator)
{
    DL_Common_updateReg(&adc12->ULLMEM.CTL1, (numerator | denominator),
        (ADC12_CTL1_AVGN_MASK | ADC12_CTL1_AVGD_MASK));
}

/**
 * @brief Return the hardware average configuration
 *
 * @param[in] adc12       Pointer to the register overlay for the peripheral
 *
 * @return Bitwise OR of @ref DL_ADC12_HW_AVG_NUM and @ref DL_ADC12_HW_AVG_DEN
 */
__STATIC_INLINE uint32_t DL_ADC12_getHwAverageConfig(ADC12_Regs *adc12)
{
    return (
        adc12->ULLMEM.CTL1 & (ADC12_CTL1_AVGN_MASK | ADC12_CTL1_AVGD_MASK));
}

/**
 *  @brief      Set sample time 0
 *
 *  @param[in]  adc12    Pointer to the register overlay for the peripheral
 *  @param[in]  adcclks  Specifies the sample time in number of ADCCLK cycles.
 *                       Actual sample time is (adcclks + 1)
 *
 */
__STATIC_INLINE void DL_ADC12_setSampleTime0(
    ADC12_Regs *adc12, uint16_t adcclks)
{
    adc12->ULLMEM.SCOMP0 = (adcclks);
}

/**
 * @brief Get sample time 0
 *
 * @param[in]   adc12   Pointer to the register overlay for the peripheral
 *
 * @return Sample time 0 in ADCCLKS.
 */
__STATIC_INLINE uint16_t DL_ADC12_getSampleTime0(ADC12_Regs *adc12)
{
    return (uint16_t)(adc12->ULLMEM.SCOMP0 + (uint32_t) 1);
}

/**
 *  @brief      Set sample time 1
 *
 *  @param[in]  adc12    Pointer to the register overlay for the peripheral
 *  @param[in]  adcclks  Specifies the sample time in number of ADCCLK cycles.
 *                       Actual sample time is (adcclks + 1)
 *
 */
__STATIC_INLINE void DL_ADC12_setSampleTime1(
    ADC12_Regs *adc12, uint16_t adcclks)
{
    adc12->ULLMEM.SCOMP1 = (adcclks);
}

/**
 * @brief Get sample time 1
 *
 * @param[in]   adc12   Pointer to the register overlay for the peripheral
 *
 * @return Sample time 1 in ADCCLKS.
 */
__STATIC_INLINE uint16_t DL_ADC12_getSampleTime1(ADC12_Regs *adc12)
{
    return (uint16_t)(adc12->ULLMEM.SCOMP1 + (uint32_t) 1);
}

/**
 * @brief Configures window comparator low threshold
 *
 * @param[in] adc12          Pointer to the register overlay for the peripheral
 * @param[in] threshold      Window comparator low threshold value. Threshold
 *                           value must take into account result data format and
 *                           and resolution confugred via
 *                           DL_ADC12_initSingleSample or DL_ADC12_initSeqSample
 */
__STATIC_INLINE void DL_ADC12_configWinCompLowThld(
    ADC12_Regs *adc12, uint16_t threshold)
{
    adc12->ULLMEM.WCLOW = (threshold);
}

/**
 * @brief Configures window comparator high threshold
 *
 * @param[in] adc12          Pointer to the register overlay for the peripheral
 * @param[in] threshold      Window comparator high threshold value. Threshold
 *                           value must take into account result data format and
 *                           and resolution confugred via
 *                           DL_ADC12_initSingleSample or DL_ADC12_initSeqSample
 */
__STATIC_INLINE void DL_ADC12_configWinCompHighThld(
    ADC12_Regs *adc12, uint16_t threshold)
{
    adc12->ULLMEM.WCHIGH = (threshold);
}

/**
 * @brief Returns the data from the top of FIFO
 *
 * @param[in] adc12         Pointer to the register overlay for the peripheral
 *
 * @return Data from the top of FIFO.
 */
__STATIC_INLINE uint32_t DL_ADC12_getFIFOData(ADC12_Regs *adc12)
{
    volatile const uint32_t *pReg = &adc12->ULLMEM.FIFODATA;

    return (uint32_t)(*(pReg + DL_ADC12_SVT_OFFSET));
}

/**
 * @brief Returns the address of FIFO data register
 *
 * @param[in] adc12         Pointer to the register overlay for the peripheral
 *
 * @return Address of FIFO data register
 */
__STATIC_INLINE uint32_t DL_ADC12_getFIFOAddress(ADC12_Regs *adc12)
{
    return ((uint32_t)(&adc12->ULLMEM.FIFODATA + DL_ADC12_SVT_OFFSET));
}

/**
 * @brief Configures conversion memory
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 * @param[in] idx      Memory conversion index. @ref DL_ADC12_MEM_IDX.
 * @param[in] chansel  Selects input channel. One of @ref DL_ADC12_INPUT_CHAN
 * @param[in] vref     Selects reference voltage. One of
 *                 @ref DL_ADC12_REFERENCE_VOLTAGE
 * @param[in] stime    Selects source of sample adc12 period. One of
 *                 @ref DL_ADC12_SAMPLE_TIMER_SOURCE
 * @param[in] avgen    Selects averaging mode. One of
 *                 @ref DL_ADC12_AVERAGING_MODE
 * @param[in] bcsen    Selects burn out current source selection. One of
 *                 @ref DL_ADC12_BURN_OUT_SOURCE
 * @param[in] trig     Selects trigger mode. One of
 *                 @ref DL_ADC12_TRIGGER_MODE
 * @param[in] wincomp  Selects window comparator mode. One of
 *                 @ref DL_ADC12_WINDOWS_COMP_MODE
 */
__STATIC_INLINE void DL_ADC12_configConversionMem(ADC12_Regs *adc12,
    DL_ADC12_MEM_IDX idx, uint32_t chansel, uint32_t vref, uint32_t stime,
    uint32_t avgen, uint32_t bcsen, uint32_t trig, uint32_t wincomp)
{
    adc12->ULLMEM.MEMCTL[idx] =
        (chansel | vref | stime | avgen | bcsen | trig | wincomp);
}

/**
 * @brief Returns conversion memory configuration
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 * @param[in] idx      Memory conversion index. @ref DL_ADC12_MEM_IDX.
 * @return Bitwise OR of @ref DL_ADC12_INPUT_CHAN,
 *         @ref DL_ADC12_REFERENCE_VOLTAGE, @ref DL_ADC12_SAMPLE_TIMER_SOURCE,
 *         @ref DL_ADC12_AVERAGING_MODE, @ref DL_ADC12_BURN_OUT_SOURCE,
 *         @ref DL_ADC12_TRIGGER_MODE, @ref DL_ADC12_WINDOWS_COMP_MODE
 *
 */
__STATIC_INLINE uint32_t DL_ADC12_getConversionMemConfig(
    ADC12_Regs *adc12, DL_ADC12_MEM_IDX idx)
{
    return (adc12->ULLMEM.MEMCTL[idx]);
}

/**
 * @brief Returns the conversion result for the selected memory index
 *
 * @param[in] adc12     Pointer to the register overlay for the peripheral
 * @param[in] idx       Memory conversion index. @ref DL_ADC12_MEM_IDX.
 *
 * @return Conversion result
 *
 */
__STATIC_INLINE uint16_t DL_ADC12_getMemResult(
    ADC12_Regs *adc12, DL_ADC12_MEM_IDX idx)
{
    volatile const uint32_t *pReg = &adc12->ULLMEM.MEMRES[idx];

    return (uint16_t)(*(pReg + DL_ADC12_SVT_OFFSET));
}

/**
 * @brief Returns the conversion result memory address.
 *
 * @param[in] adc12     Pointer to the register overlay for the peripheral
 * @param[in] idx       Memory conversion index. @ref DL_ADC12_MEM_IDX.
 *
 * @return Conversion result memory address
 *
 */
__STATIC_INLINE uint32_t DL_ADC12_getMemResultAddress(
    ADC12_Regs *adc12, DL_ADC12_MEM_IDX idx)
{
    return ((uint32_t)(&adc12->ULLMEM.MEMRES[idx] + DL_ADC12_SVT_OFFSET));
}

/**
 * @brief Returns ADC12 status
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 *
 * @return Bitwise OR of @ref DL_ADC12_STATUS_CONVERSION and
 *         @ref DL_ADC12_STATUS_REFERENCE
 *
 */
__STATIC_INLINE uint32_t DL_ADC12_getStatus(ADC12_Regs *adc12)
{
    return (adc12->ULLMEM.STATUS);
}

/**
 * @brief Allows SYSOSC to not run at base frequency when device is in RUN mode.
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 *
 *
 */
__STATIC_INLINE void DL_ADC12_disableForcingSYSOSCOnInRunMode(
    ADC12_Regs *adc12)
{
    DL_Common_updateReg(&adc12->ULLMEM.GPRCM.CLKCFG,
        (ADC12_CLKCFG_CCONRUN_DISABLE | ADC12_CLKCFG_KEY_UNLOCK_W),
        (ADC12_CLKCFG_CCONRUN_MASK | ADC12_CLKCFG_KEY_MASK));
}

/**
 * @brief Forces SYSOSC to run at base frequency when device is in RUN mode.
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 *
 *
 */
__STATIC_INLINE void DL_ADC12_forceSYSOSCOnInRunMode(ADC12_Regs *adc12)
{
    adc12->ULLMEM.GPRCM.CLKCFG |=
        (ADC12_CLKCFG_KEY_UNLOCK_W | ADC12_CLKCFG_CCONRUN_ENABLE);
}

